Интенсивное_обучение_программированию/src/InformationRegisters/ЦенаНоменклатуры/ЦенаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦенаНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.ДенежныеСредства</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Интенсивное_обучение_программированию/src/InformationRegisters/ЦенаНоменклатуры/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьАктуальнуюЦену(Номенклатура, ПериодОтбора) Экспорт
	
ЦенаНоменклатуры 	= 0;
	
	Отбор 			= Новый Структура ("Номенклатура", Номенклатура);
	ТаблицаЦен 		= СрезПоследних(ПериодОтбора, Отбор);
	
	Если ТаблицаЦен.Количество() > 0 Тогда
		
		ЦенаНоменклатуры = ТаблицаЦен.Итог("Цена");
				
	КонецЕсли;
	
	Возврат ЦенаНоменклатуры;
	
КонецФункции

#КонецОбласти
